{
  "summaries": {
    "CRM Software": "Based on what you told me, you are looking for the CRM that your company will be using instead of the current one, which is HubSpot. Your company has 20 salespeople. This CRM will be 20 seats and must be mobile-first because the team is sitting in different countries and working from the phones. You are willing to explore both established solutions and start-ups alike. The main criteria is that the CRM should be extremely easy to use but expandable with add-ons.",
    "Marketing Automation": "Based on your input, you need a marketing automation platform to replace your current solution. Your marketing team of 15 people requires advanced segmentation capabilities, multi-channel campaign management across email and social media, and seamless integration with your existing CRM. You're looking for a solution that can handle your growing contact database of 100K+ leads while providing detailed analytics and ROI tracking. Both enterprise solutions and innovative startups are being considered.",
    "DevOps & Infrastructure": "Based on what you shared, you're seeking a cloud infrastructure provider to support your application stack serving 50K+ daily active users. Your development team of 10 engineers needs container orchestration, auto-scaling capabilities, and multi-region deployment support. The solution must offer strong security compliance (SOC 2, GDPR), 99.9% uptime SLA, and seamless integration with your CI/CD pipeline. You're open to evaluating both major cloud providers and specialized alternatives.",
    "Project Management": "Based on your description, you need a project management tool for your distributed team of 30 people across 5 time zones. You're currently using spreadsheets and need a proper solution that supports agile methodologies, provides real-time collaboration features, and integrates with Slack and GitHub. The platform should offer detailed reporting for stakeholders while being intuitive enough for non-technical team members.",
    "Analytics & BI": "Based on what you told me, you're looking for a business intelligence platform that can handle your large datasets (10M+ rows) and provide real-time dashboards for executive leadership. Your team needs self-service analytics for non-technical users, seamless integration with your SQL databases and data warehouse, and the ability to create custom visualizations. Mobile access is essential for your C-suite executives.",
    "Communication Tools": "Based on your input, you need a unified communication platform for your 200+ employees to replace your current fragmented setup. The solution must combine video conferencing, instant messaging, and file sharing in one place. International calling support, excellent mobile apps, and Microsoft 365 integration are critical. Reliability and ease of use are priorities for your daily all-hands meetings.",
    "Security Solutions": "Based on what you shared, you need an enterprise-grade security monitoring solution for your cloud infrastructure on AWS. You require real-time threat detection, automated incident response, and compliance reporting for SOC 2 and GDPR. The solution should integrate with your existing SIEM and provide 24/7 threat intelligence with a dedicated security operations team.",
    "DevOps & Infrastructure": "Based on your description, you're searching for a CI/CD platform that can handle your microservices architecture with 50+ services. You need container orchestration, automated testing, blue-green deployments, and seamless Kubernetes integration. The platform must support both on-premise and cloud deployments with detailed logging and monitoring capabilities.",
    "HR & Talent Management": "Based on what you told me, you're looking for an all-in-one HR platform for your company of 150 employees to replace your current manual processes. You need applicant tracking, onboarding workflows, performance management, and time-off tracking in one system. Integration with your payroll system is critical, and the interface should be intuitive for both HR staff and employees.",
    "E-commerce Platforms": "Based on your input, you're searching for a scalable e-commerce solution for your B2B marketplace with 5000+ SKUs. You need multi-vendor support, complex pricing rules, integration with your ERP system, and international shipping capabilities. The platform must handle high transaction volumes (10K+ orders/month) with full PCI compliance and support for multiple currencies.",
    "Data Management": "Based on what you shared, you're looking for a modern data warehouse solution that can consolidate data from your 15+ sources including CRM, ERP, and marketing tools. You need real-time data pipelines, data quality monitoring, and support for both structured and unstructured data. A cloud-native architecture is preferred with strong data governance features and compliance capabilities.",
    "AI & Machine Learning": "Based on your description, you're seeking an ML platform for deploying predictive models in production. Your data science team needs support for Python/R, automated model training, version control, and real-time inference APIs. The platform must handle your scale (1M+ predictions/day) with monitoring for model drift and explainability features for regulatory compliance."
  },
  "default": "Tell us what technology you're exploring and we'll help you find the perfect vendors."
}
